---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyList
source: html/8f1e901e-d1a6-e8f1-0e10-d8b28e0ad073.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyList

Represents a list of AssetProperty(s).

## Syntax (C#)
```csharp
public class AssetPropertyList : AssetProperty
```